
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 4 to add, 5 to change, 10 to destroy.</code></pre>

* Update
  * azurerm_virtual_network.migration
  * module.darts_key_vault.azurerm_monitor_diagnostic_setting.kv-ds
  * module.darts_migration_key_vault.azurerm_key_vault.kv
  * module.darts_migration_key_vault.azurerm_monitor_diagnostic_setting.kv-ds
  * module.sa-migration.azurerm_storage_account.storage_account
* Delete
  * azurerm_firewall.migration_firewall
  * azurerm_firewall_policy.migration_policy
  * azurerm_firewall_policy_rule_collection_group.migration_policy_rules
  * azurerm_log_analytics_workspace.firewall_log_analytics[0]
  * azurerm_public_ip.firewall_public_ip
  * azurerm_subnet.firewall_subnet
* Replace
  * module.darts_migration_key_vault.azurerm_key_vault_access_policy.creator_access_policy
  * module.darts_migration_key_vault.azurerm_key_vault_access_policy.developer[0]
  * module.darts_migration_key_vault.azurerm_key_vault_access_policy.managed_identity_access_policy[&#34;b31f6666-e2e4-4a0b-9399-b64446b1e412&#34;]
  * module.darts_migration_key_vault.azurerm_key_vault_access_policy.product_team_access_policy


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_firewall.migration_firewall will be destroyed
  # (because azurerm_firewall.migration_firewall is not in configuration)
  - resource "azurerm_firewall" "migration_firewall" {
      - dns_servers         = [] -> null
      - firewall_policy_id  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.Network/firewallPolicies/darts-migration-policy-stg" -> null
      - id                  = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.Network/azureFirewalls/darts-migration-firewall-stg" -> null
      - location            = "uksouth" -> null
      - name                = "darts-migration-firewall-stg" -> null
      - private_ip_ranges   = [] -> null
      - resource_group_name = "darts-migration-stg-rg" -> null
      - sku_name            = "AZFW_VNet" -> null
      - sku_tier            = "Premium" -> null
      - tags                = {
          - "application"         = "darts"
          - "autoShutdown"        = "true"
          - "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
          - "businessArea"        = "Cross-Cutting"
          - "contactSlackChannel" = "#darts-devs"
          - "environment"         = "staging"
          - "managedBy"           = "Darts Modernisation"
        } -> null
      - threat_intel_mode   = "Alert" -> null
      - zones               = [] -> null

      - ip_configuration {
          - name                 = "configuration" -> null
          - private_ip_address   = "10.24.239.196" -> null
          - public_ip_address_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.Network/publicIPAddresses/firewall-pip-stg" -> null
          - subnet_id            = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.Network/virtualNetworks/migration-vnet/subnets/AzureFirewallSubnet" -> null
        }
    }

  # azurerm_firewall_policy.migration_policy will be destroyed
  # (because azurerm_firewall_policy.migration_policy is not in configuration)
  - resource "azurerm_firewall_policy" "migration_policy" {
      - auto_learn_private_ranges_enabled = false -> null
      - child_policies                    = [] -> null
      - firewalls                         = [
          - "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.Network/azureFirewalls/darts-migration-firewall-stg",
        ] -> null
      - id                                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.Network/firewallPolicies/darts-migration-policy-stg" -> null
      - location                          = "uksouth" -> null
      - name                              = "darts-migration-policy-stg" -> null
      - private_ip_ranges                 = [] -> null
      - resource_group_name               = "darts-migration-stg-rg" -> null
      - rule_collection_groups            = [
          - "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.Network/firewallPolicies/darts-migration-policy-stg/ruleCollectionGroups/darts-migration-fwpolicyrules-stg",
        ] -> null
      - sku                               = "Standard" -> null
      - tags                              = {
          - "application"         = "darts"
          - "autoShutdown"        = "true"
          - "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
          - "businessArea"        = "Cross-Cutting"
          - "contactSlackChannel" = "#darts-devs"
          - "environment"         = "staging"
          - "managedBy"           = "Darts Modernisation"
        } -> null
      - threat_intelligence_mode          = "Alert" -> null

      - insights {
          - default_log_analytics_workspace_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.OperationalInsights/workspaces/darts-migration-log-analytics-stg" -> null
          - enabled                            = true -> null
          - retention_in_days                  = 30 -> null

          - log_analytics_workspace {
              - firewall_location = "uksouth" -> null
              - id                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.OperationalInsights/workspaces/darts-migration-log-analytics-stg" -> null
            }
        }
    }

  # azurerm_firewall_policy_rule_collection_group.migration_policy_rules will be destroyed
  # (because azurerm_firewall_policy_rule_collection_group.migration_policy_rules is not in configuration)
  - resource "azurerm_firewall_policy_rule_collection_group" "migration_policy_rules" {
      - firewall_policy_id = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.Network/firewallPolicies/darts-migration-policy-stg" -> null
      - id                 = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.Network/firewallPolicies/darts-migration-policy-stg/ruleCollectionGroups/darts-migration-fwpolicyrules-stg" -> null
      - name               = "darts-migration-fwpolicyrules-stg" -> null
      - priority           = 100 -> null

      - nat_rule_collection {
          - action   = "Dnat" -> null
          - name     = "darts-migration-dnat-stg" -> null
          - priority = 100 -> null

          - rule {
              - destination_address = "10.24.239.196" -> null
              - destination_ports   = [
                  - "3218",
                ] -> null
              - name                = "CN0052-Node1-A-DNAT-3218" -> null
              - protocols           = [
                  - "TCP",
                  - "UDP",
                ] -> null
              - source_addresses    = [
                  - "10.63.111.175",
                ] -> null
              - source_ip_groups    = [] -> null
              - translated_address  = "10.23.253.241" -> null
              - translated_port     = 3218 -> null
            }
          - rule {
              - destination_address = "10.24.239.196" -> null
              - destination_ports   = [
                  - "3682",
                ] -> null
              - name                = "CN0052-Node1-A-DNAT-3682" -> null
              - protocols           = [
                  - "TCP",
                  - "UDP",
                ] -> null
              - source_addresses    = [
                  - "10.63.111.175",
                ] -> null
              - source_ip_groups    = [] -> null
              - translated_address  = "10.23.253.241" -> null
              - translated_port     = 3682 -> null
            }
          - rule {
              - destination_address = "10.24.239.196" -> null
              - destination_ports   = [
                  - "3218",
                ] -> null
              - name                = "CN0052-Node1-B-DNAT-3218" -> null
              - protocols           = [
                  - "TCP",
                  - "UDP",
                ] -> null
              - source_addresses    = [
                  - "10.63.111.187",
                ] -> null
              - source_ip_groups    = [] -> null
              - translated_address  = "10.23.253.241" -> null
              - translated_port     = 3218 -> null
            }
          - rule {
              - destination_address = "10.24.239.196" -> null
              - destination_ports   = [
                  - "3682",
                ] -> null
              - name                = "CN0052-Node1-B-DNAT-3682" -> null
              - protocols           = [
                  - "TCP",
                  - "UDP",
                ] -> null
              - source_addresses    = [
                  - "10.63.111.187",
                ] -> null
              - source_ip_groups    = [] -> null
              - translated_address  = "10.23.253.241" -> null
              - translated_port     = 3682 -> null
            }
          - rule {
              - destination_address = "10.24.239.196" -> null
              - destination_ports   = [
                  - "3218",
                ] -> null
              - name                = "CN0052-Node2-A-DNAT-3218" -> null
              - protocols           = [
                  - "TCP",
                  - "UDP",
                ] -> null
              - source_addresses    = [
                  - "10.63.111.176",
                ] -> null
              - source_ip_groups    = [] -> null
              - translated_address  = "10.23.253.242" -> null
              - translated_port     = 3218 -> null
            }
          - rule {
              - destination_address = "10.24.239.196" -> null
              - destination_ports   = [
                  - "3682",
                ] -> null
              - name                = "CN0052-Node2-A-DNAT-3682" -> null
              - protocols           = [
                  - "TCP",
                  - "UDP",
                ] -> null
              - source_addresses    = [
                  - "10.63.111.176",
                ] -> null
              - source_ip_groups    = [] -> null
              - translated_address  = "10.23.253.242" -> null
              - translated_port     = 3682 -> null
            }
          - rule {
              - destination_address = "10.24.239.196" -> null
              - destination_ports   = [
                  - "3218",
                ] -> null
              - name                = "CN0052-Node2-B-DNAT-3218" -> null
              - protocols           = [
                  - "TCP",
                  - "UDP",
                ] -> null
              - source_addresses    = [
                  - "10.63.111.188",
                ] -> null
              - source_ip_groups    = [] -> null
              - translated_address  = "10.23.253.242" -> null
              - translated_port     = 3218 -> null
            }
          - rule {
              - destination_address = "10.24.239.196" -> null
              - destination_ports   = [
                  - "3682",
                ] -> null
              - name                = "CN0052-Node2-B-DNAT-3682" -> null
              - protocols           = [
                  - "TCP",
                  - "UDP",
                ] -> null
              - source_addresses    = [
                  - "10.63.111.188",
                ] -> null
              - source_ip_groups    = [] -> null
              - translated_address  = "10.23.253.242" -> null
              - translated_port     = 3682 -> null
            }
          - rule {
              - destination_address = "10.24.239.196" -> null
              - destination_ports   = [
                  - "3218",
                ] -> null
              - name                = "CN0052-Node3-A-DNAT-3218" -> null
              - protocols           = [
                  - "TCP",
                  - "UDP",
                ] -> null
              - source_addresses    = [
                  - "10.65.64.155",
                ] -> null
              - source_ip_groups    = [] -> null
              - translated_address  = "10.23.253.243" -> null
              - translated_port     = 3218 -> null
            }
          - rule {
              - destination_address = "10.24.239.196" -> null
              - destination_ports   = [
                  - "3682",
                ] -> null
              - name                = "CN0052-Node3-A-DNAT-3682" -> null
              - protocols           = [
                  - "TCP",
                  - "UDP",
                ] -> null
              - source_addresses    = [
                  - "10.65.64.155",
                ] -> null
              - source_ip_groups    = [] -> null
              - translated_address  = "10.23.253.243" -> null
              - translated_port     = 3682 -> null
            }
          - rule {
              - destination_address = "10.24.239.196" -> null
              - destination_ports   = [
                  - "3218",
                ] -> null
              - name                = "CN0052-Node3-B-DNAT-3218" -> null
              - protocols           = [
                  - "TCP",
                  - "UDP",
                ] -> null
              - source_addresses    = [
                  - "10.65.64.180",
                ] -> null
              - source_ip_groups    = [] -> null
              - translated_address  = "10.23.253.243" -> null
              - translated_port     = 3218 -> null
            }
          - rule {
              - destination_address = "10.24.239.196" -> null
              - destination_ports   = [
                  - "3682",
                ] -> null
              - name                = "CN0052-Node3-B-DNAT-3682" -> null
              - protocols           = [
                  - "TCP",
                  - "UDP",
                ] -> null
              - source_addresses    = [
                  - "10.65.64.180",
                ] -> null
              - source_ip_groups    = [] -> null
              - translated_address  = "10.23.253.243" -> null
              - translated_port     = 3682 -> null
            }
          - rule {
              - destination_address = "10.24.239.196" -> null
              - destination_ports   = [
                  - "3218",
                ] -> null
              - name                = "CN0052-Node4-A-DNAT-3218" -> null
              - protocols           = [
                  - "TCP",
                  - "UDP",
                ] -> null
              - source_addresses    = [
                  - "10.65.64.156",
                ] -> null
              - source_ip_groups    = [] -> null
              - translated_address  = "10.23.253.244" -> null
              - translated_port     = 3218 -> null
            }
          - rule {
              - destination_address = "10.24.239.196" -> null
              - destination_ports   = [
                  - "3682",
                ] -> null
              - name                = "CN0052-Node4-A-DNAT-3682" -> null
              - protocols           = [
                  - "TCP",
                  - "UDP",
                ] -> null
              - source_addresses    = [
                  - "10.65.64.156",
                ] -> null
              - source_ip_groups    = [] -> null
              - translated_address  = "10.23.253.244" -> null
              - translated_port     = 3682 -> null
            }
          - rule {
              - destination_address = "10.24.239.196" -> null
              - destination_ports   = [
                  - "3218",
                ] -> null
              - name                = "CN0052-Node4-B-DNAT-3218" -> null
              - protocols           = [
                  - "TCP",
                  - "UDP",
                ] -> null
              - source_addresses    = [
                  - "10.65.64.181",
                ] -> null
              - source_ip_groups    = [] -> null
              - translated_address  = "10.23.253.244" -> null
              - translated_port     = 3218 -> null
            }
          - rule {
              - destination_address = "10.24.239.196" -> null
              - destination_ports   = [
                  - "3682",
                ] -> null
              - name                = "CN0052-Node4-B-DNAT-3682" -> null
              - protocols           = [
                  - "TCP",
                  - "UDP",
                ] -> null
              - source_addresses    = [
                  - "10.65.64.181",
                ] -> null
              - source_ip_groups    = [] -> null
              - translated_address  = "10.23.253.244" -> null
              - translated_port     = 3682 -> null
            }
        }

      - network_rule_collection {
          - action   = "Allow" -> null
          - name     = "darts-migration-stg" -> null
          - priority = 300 -> null

          - rule {
              - destination_addresses = [
                  - "10.23.253.177/32",
                  - "10.23.253.178/32",
                ] -> null
              - destination_fqdns     = [] -> null
              - destination_ip_groups = [] -> null
              - destination_ports     = [
                  - "22",
                  - "1521",
                ] -> null
              - name                  = "App Inbound" -> null
              - protocols             = [
                  - "TCP",
                ] -> null
              - source_addresses      = [
                  - "10.24.239.64/28",
                ] -> null
              - source_ip_groups      = [] -> null
            }
          - rule {
              - destination_addresses = [
                  - "10.24.239.64/28",
                ] -> null
              - destination_fqdns     = [] -> null
              - destination_ip_groups = [] -> null
              - destination_ports     = [
                  - "22",
                  - "1521",
                ] -> null
              - name                  = "App Outbound" -> null
              - protocols             = [
                  - "TCP",
                ] -> null
              - source_addresses      = [
                  - "10.23.253.177/32",
                  - "10.23.253.178/32",
                ] -> null
              - source_ip_groups      = [] -> null
            }
          - rule {
              - destination_addresses = [
                  - "10.23.253.241/32",
                  - "10.23.253.242/32",
                  - "10.23.253.243/32",
                  - "10.23.253.244/32",
                ] -> null
              - destination_fqdns     = [] -> null
              - destination_ip_groups = [] -> null
              - destination_ports     = [
                  - "3218",
                  - "3682",
                ] -> null
              - name                  = "DARTS Centerra Inbound" -> null
              - protocols             = [
                  - "TCP",
                  - "UDP",
                ] -> null
              - source_addresses      = [
                  - "10.24.239.64/28",
                ] -> null
              - source_ip_groups      = [] -> null
            }
          - rule {
              - destination_addresses = [
                  - "10.24.239.64/28",
                ] -> null
              - destination_fqdns     = [] -> null
              - destination_ip_groups = [] -> null
              - destination_ports     = [
                  - "3218",
                  - "3682",
                ] -> null
              - name                  = "DARTS Centerra Outbound" -> null
              - protocols             = [
                  - "TCP",
                  - "UDP",
                ] -> null
              - source_addresses      = [
                  - "10.23.253.241/32",
                  - "10.23.253.242/32",
                  - "10.23.253.243/32",
                  - "10.23.253.244/32",
                ] -> null
              - source_ip_groups      = [] -> null
            }
        }
    }

  # azurerm_log_analytics_workspace.firewall_log_analytics[0] will be destroyed
  # (because azurerm_log_analytics_workspace.firewall_log_analytics is not in configuration)
  - resource "azurerm_log_analytics_workspace" "firewall_log_analytics" {
      - allow_resource_only_permissions = true -> null
      - cmk_for_query_forced            = false -> null
      - daily_quota_gb                  = 5 -> null
      - id                              = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.OperationalInsights/workspaces/darts-migration-log-analytics-stg" -> null
      - internet_ingestion_enabled      = true -> null
      - internet_query_enabled          = true -> null
      - local_authentication_disabled   = false -> null
      - location                        = "uksouth" -> null
      - name                            = "darts-migration-log-analytics-stg" -> null
      - primary_shared_key              = (sensitive value) -> null
      - resource_group_name             = "darts-migration-stg-rg" -> null
      - retention_in_days               = 30 -> null
      - secondary_shared_key            = (sensitive value) -> null
      - sku                             = "PerGB2018" -> null
      - tags                            = {
          - "application"         = "darts"
          - "autoShutdown"        = "true"
          - "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
          - "businessArea"        = "Cross-Cutting"
          - "contactSlackChannel" = "#darts-devs"
          - "environment"         = "staging"
          - "managedBy"           = "Darts Modernisation"
        } -> null
      - workspace_id                    = "9cd295fe-b145-4fb0-ac7c-50c04169785d" -> null
    }

  # azurerm_public_ip.firewall_public_ip will be destroyed
  # (because azurerm_public_ip.firewall_public_ip is not in configuration)
  - resource "azurerm_public_ip" "firewall_public_ip" {
      - allocation_method       = "Static" -> null
      - ddos_protection_mode    = "VirtualNetworkInherited" -> null
      - id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.Network/publicIPAddresses/firewall-pip-stg" -> null
      - idle_timeout_in_minutes = 4 -> null
      - ip_address              = "51.11.186.88" -> null
      - ip_tags                 = {} -> null
      - ip_version              = "IPv4" -> null
      - location                = "uksouth" -> null
      - name                    = "firewall-pip-stg" -> null
      - resource_group_name     = "darts-migration-stg-rg" -> null
      - sku                     = "Standard" -> null
      - sku_tier                = "Regional" -> null
      - tags                    = {
          - "application"         = "darts"
          - "autoShutdown"        = "true"
          - "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
          - "businessArea"        = "Cross-Cutting"
          - "contactSlackChannel" = "#darts-devs"
          - "environment"         = "staging"
          - "managedBy"           = "Darts Modernisation"
        } -> null
      - zones                   = [] -> null
    }

  # azurerm_subnet.firewall_subnet will be destroyed
  # (because azurerm_subnet.firewall_subnet is not in configuration)
  - resource "azurerm_subnet" "firewall_subnet" {
      - address_prefixes                               = [
          - "10.24.239.192/26",
        ] -> null
      - enforce_private_link_endpoint_network_policies = false -> null
      - enforce_private_link_service_network_policies  = false -> null
      - id                                             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.Network/virtualNetworks/migration-vnet/subnets/AzureFirewallSubnet" -> null
      - name                                           = "AzureFirewallSubnet" -> null
      - private_endpoint_network_policies_enabled      = true -> null
      - private_link_service_network_policies_enabled  = true -> null
      - resource_group_name                            = "darts-migration-stg-rg" -> null
      - service_endpoint_policy_ids                    = [] -> null
      - service_endpoints                              = [] -> null
      - virtual_network_name                           = "migration-vnet" -> null
    }

  # azurerm_virtual_network.migration will be updated in-place
  ~ resource "azurerm_virtual_network" "migration" {
      ~ address_space           = [
            "10.24.239.64/28",
          - "10.24.239.192/26",
        ]
        id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.Network/virtualNetworks/migration-vnet"
        name                    = "migration-vnet"
        tags                    = {
            "application"         = "darts"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "staging"
            "managedBy"           = "Darts Modernisation"
        }
        # (6 unchanged attributes hidden)
    }

  # module.darts_key_vault.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-stg-rg/providers/Microsoft.KeyVault/vaults/darts-stg|darts-stg"
        name                           = "darts-stg"
        # (3 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.darts_migration_key_vault.data.azuread_group.developers will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azuread_group" "developers" {
      + assignable_to_role             = (known after apply)
      + auto_subscribe_new_members     = (known after apply)
      + behaviors                      = (known after apply)
      + description                    = (known after apply)
      + display_name                   = "DTS CFT Developers"
      + dynamic_membership             = (known after apply)
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_enabled                   = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + provisioning_options           = (known after apply)
      + proxy_addresses                = (known after apply)
      + security_enabled               = (known after apply)
      + theme                          = (known after apply)
      + types                          = (known after apply)
      + visibility                     = (known after apply)
      + writeback_enabled              = (known after apply)
    }

  # module.darts_migration_key_vault.data.azuread_group.product_team[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azuread_group" "product_team" {
      + assignable_to_role             = (known after apply)
      + auto_subscribe_new_members     = (known after apply)
      + behaviors                      = (known after apply)
      + description                    = (known after apply)
      + display_name                   = "DTS Darts Modernisation"
      + dynamic_membership             = (known after apply)
      + external_senders_allowed       = (known after apply)
      + hide_from_address_lists        = (known after apply)
      + hide_from_outlook_clients      = (known after apply)
      + id                             = (known after apply)
      + mail                           = (known after apply)
      + mail_enabled                   = (known after apply)
      + mail_nickname                  = (known after apply)
      + members                        = (known after apply)
      + object_id                      = (known after apply)
      + onpremises_domain_name         = (known after apply)
      + onpremises_group_type          = (known after apply)
      + onpremises_netbios_name        = (known after apply)
      + onpremises_sam_account_name    = (known after apply)
      + onpremises_security_identifier = (known after apply)
      + onpremises_sync_enabled        = (known after apply)
      + owners                         = (known after apply)
      + preferred_language             = (known after apply)
      + provisioning_options           = (known after apply)
      + proxy_addresses                = (known after apply)
      + security_enabled               = true
      + theme                          = (known after apply)
      + types                          = (known after apply)
      + visibility                     = (known after apply)
      + writeback_enabled              = (known after apply)
    }

  # module.darts_migration_key_vault.data.azurerm_client_config.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_client_config" "current" {
      + client_id       = (known after apply)
      + id              = (known after apply)
      + object_id       = (known after apply)
      + subscription_id = (known after apply)
      + tenant_id       = (known after apply)
    }

  # module.darts_migration_key_vault.azurerm_key_vault.kv will be updated in-place
  ~ resource "azurerm_key_vault" "kv" {
        id                              = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.KeyVault/vaults/darts-migration-stg"
        name                            = "darts-migration-stg"
        tags                            = {
            "application"         = "darts"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "staging"
            "managedBy"           = "Darts Modernisation"
        }
      ~ tenant_id                       = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> (known after apply)
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.darts_migration_key_vault.azurerm_key_vault_access_policy.creator_access_policy must be replaced
-/+ resource "azurerm_key_vault_access_policy" "creator_access_policy" {
      ~ id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.KeyVault/vaults/darts-migration-stg/objectId/7ef3b6ce-3974-41ab-8512-c3ef4bb8ae01" -> (known after apply)
      - storage_permissions     = [] -> null
      ~ tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" # forces replacement -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.darts_migration_key_vault.azurerm_key_vault_access_policy.developer[0] must be replaced
-/+ resource "azurerm_key_vault_access_policy" "developer" {
      ~ id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.KeyVault/vaults/darts-migration-stg/objectId/b2a1773c-a5ae-48b5-b5fa-95b0e05eee05" -> (known after apply)
      ~ object_id               = "b2a1773c-a5ae-48b5-b5fa-95b0e05eee05" # forces replacement -> (known after apply)
      - storage_permissions     = [] -> null
      ~ tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" # forces replacement -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.darts_migration_key_vault.azurerm_key_vault_access_policy.managed_identity_access_policy["b31f6666-e2e4-4a0b-9399-b64446b1e412"] must be replaced
-/+ resource "azurerm_key_vault_access_policy" "managed_identity_access_policy" {
      ~ id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.KeyVault/vaults/darts-migration-stg/objectId/b31f6666-e2e4-4a0b-9399-b64446b1e412" -> (known after apply)
      - storage_permissions     = [] -> null
      ~ tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" # forces replacement -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.darts_migration_key_vault.azurerm_key_vault_access_policy.product_team_access_policy must be replaced
-/+ resource "azurerm_key_vault_access_policy" "product_team_access_policy" {
      ~ id                      = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.KeyVault/vaults/darts-migration-stg/objectId/87c8cf3d-ff9d-4d8f-8430-ccc737764435" -> (known after apply)
      ~ object_id               = "87c8cf3d-ff9d-4d8f-8430-ccc737764435" # forces replacement -> (known after apply)
      - storage_permissions     = [] -> null
      ~ tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" # forces replacement -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.darts_migration_key_vault.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                             = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.KeyVault/vaults/darts-migration-stg|darts-migration-stg"
        name                           = "darts-migration-stg"
        # (3 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.sa-migration.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
        id                                = "/subscriptions/74dacd4f-a248-45bb-a2f0-af700dc4cf68/resourceGroups/darts-migration-stg-rg/providers/Microsoft.Storage/storageAccounts/sastgdartsmig01"
        name                              = "sastgdartsmig01"
        tags                              = {
            "application"         = "darts"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/darts-shared-infrastructure.git"
            "businessArea"        = "Cross-Cutting"
            "contactSlackChannel" = "#darts-devs"
            "environment"         = "staging"
            "managedBy"           = "Darts Modernisation"
        }
        # (31 unchanged attributes hidden)

      ~ blob_properties {
          ~ versioning_enabled            = false -> true
            # (3 unchanged attributes hidden)

          + container_delete_retention_policy {
              + days = 7
            }

          + delete_retention_policy {
              + days = 365
            }
        }

        # (1 unchanged block hidden)
    }

Plan: 4 to add, 5 to change, 10 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":110,"Program":"tfcmt","SHA1":"","Vars":{}} -->